Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new FilteredElementCollector that will search and filter the visible elements in a view.
Remarks:
Elements that will be passed by the collector have graphics that may be visible in
the input view. Some elements may still be hidden because they are obscured by other elements.
Accessing these visible elements may require Revit to rebuild the geometry of the view.
The first time your code constructs a collector for a given view, or the first time
your code constructs a collector for a view whose display settings have just been changed,
you may experience a significant performance degradation.
document:
The document that owns the view.
viewId:
The view id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011